Tekla Open API Reference for Tekla Structures 2025
ProfileItem.DeleteCrossSection Method
 Deletes the cross section of a profile.
 Namespace: Tekla.Structures.Catalogs
 Assembly: Tekla.Structures.Catalogs (in Tekla.Structures.Catalogs.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public bool DeleteCrossSection(
	int CrossSectionNumber
)
Public Function DeleteCrossSection (
	CrossSectionNumber As Integer
) As Boolean
Parameters
CrossSectionNumber
Type: System.Int32
The cross section number.
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Tekla.Structures.Catalogs.ProfileItem.DeleteCrossSection(System.Int32)"]
See Also
Reference
ProfileItem Class
Tekla.Structures.Catalogs Namespace